@antonbabenko  thanks. I tried that before but it would force the recreation of the cert:

```
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.site-co-uk.aws_acm_certificate.this[0] must be replaced
+/- resource "aws_acm_certificate" "this" {
      ~ arn                       = "arn:aws:acm:eu-west-1:12345:certificate/XXXX" -> (known after apply)
      ~ domain_name               = "*.site.co.uk" -> "site.co.uk" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.site.co.uk"
              - resource_record_name  = "_4dcf16a519cd998d6ce83de46d6288fd.site.co.uk."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_7eaf393c237a0f6745b8946051447306.ltfvzjuylp.acm-validations.aws."
            },
        ] -> (known after apply)
      ~ id                        = "arn:aws:acm:eu-west-1:12345:certificate/XXXXXX" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.site.co.uk",
        ]
        tags                      = {
            "CostCenter" = "site"
            "Name"       = "wildcard-site.co.uk"
            "Terraform"  = "true"
        }
      ~ validation_emails         = [] -> (known after apply)
        validation_method         = "DNS"
    }

  # module.site-co-uk.aws_acm_certificate_validation.this[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "this" {
      ~ certificate_arn         = "arn:aws:acm:eu-west-1:538364834955:certificate/63ed942d-6bcd-46b4-a114-81f72025c301" -> (known after apply) # forces replacement
      ~ id                      = "2019-05-30 11:02:32 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_4dcf16a519cd998d6ce83de46d6288fd.site.co.uk",
        ] -> (known after apply) # forces replacement

      - timeouts {}
    }

  # module.site-co-uk.aws_route53_record.validation[0] must be replaced
-/+ resource "aws_route53_record" "validation" {
        allow_overwrite = true
      ~ fqdn            = "_4dcf16a519cd998d6ce83de46d6288fd.site.co.uk" -> (known after apply)
      ~ id              = "Z1Y0Y8ITAJ6H01__4dcf16a519cd998d6ce83de46d6288fd.site.co.uk_CNAME" -> (known after apply)
      ~ name            = "_4dcf16a519cd998d6ce83de46d6288fd.site.co.uk" -> (known after apply) # forces replacement
      ~ records         = [
          - "_7eaf393c237a0f6745b8946051447306.ltfvzjuylp.acm-validations.aws.",
        ] -> (known after apply)
        ttl             = 60
      ~ type            = "CNAME" -> (known after apply)
        zone_id         = "Z123456"
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

Is that the only way? To recreate it?